# Завдання 1
a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))
c = int(input("Введіть третє число: "))
d = int(input("Введіть четверте число: "))

# Завдання 2
results = [
    a + b,        
    c - d,        
    a * c,        
    b / d,       
    c ** 2,    # піднесення до ступеня
    d // c,    # цілочисленне ділення
    d % c      # остача від ділення
]

# Завдання 3
print("Кількість елементів у списку:", len(results))
print("Парні елементи списку:")
for element in results:
    if isinstance(element, int) and element % 2 == 0:
        print(element)

# Завдання 4
results[1], results[4] = results[4], results[1]
print("Список після обміну 2-го і 5-го елементів:", results)

# Завдання 5
name = input("Введіть ваше прізвище та ім’я: ")
print("\nВиконав лабораторну роботу:")
print(name)
print("Висновки:")
print("Засвоєно роботу з введенням даних.")
print("Опановано як виконувати математичні операції з числами.")
print("Отримано досвід роботи зі списками та умовними операторами.")
